trunk/app/controllers/posts_controller.rb

SELECT * FROM "posts"
---
  def index
    @posts = Post.all.reverse

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def show
    @post = Post.find(params[:timestamps])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2010-04-08 10:56:09', 'kikoo', 'test', '2010-04-08 10:56:09')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2010-04-08 12:19:52', "body" = 'testqsgqzrg
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
DELETE FROM "posts" WHERE "id" = 2
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy