trunk/app/controllers/videos_controller.rb

SELECT * FROM `videos`
---
  def index
    @videos = Video.all

SELECT * FROM `videos` WHERE (`videos`.`id` = 1)
---
  def show
    @video = Video.find(params[:id])

INSERT INTO `videos` (`name`, `created_at`, `updated_at`, `url`) VALUES('VideoTest1', '2010-04-05 01:52:37', '2010-04-05 01:52:37', 'lol.avi')
---
  def create
    @video = Video.new(params[:video])
    @video.safe_name = @video.name.urlize(:regexp => /[^A-Za-z0-9]/)

    respond_to do |format|
      if @video.save