app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id") VALUES('2010-04-08 12:33:19', 'qrsg', '2010-04-08 12:33:19', 1)
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])